Revit 2027 API
IExtension.IsMiterLocked Property
Retrieves or set the miter locked status at the end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool this[
	int index
] { get; set; }
Property IsMiterLocked (
	index As Integer
) As Boolean
	Get
	Set
property bool IsMiterLocked[int index] {
	bool get (int index);
	void set (int index, bool value);
}
abstract IsMiterLocked : bool with get, set
Parameters
index Int32
Property Value
Boolean
Remarks
Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown. For beams, only if the beam is extended and is mitered with other beams at the end, it can be locked. Otherwise, the setting is invalid
See Also
Reference
IExtension Interface
Autodesk.Revit.DB Namespace